{"config": {"name": "sequential_1", "layers": [{"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "padding": "valid", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_2", "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_3", "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_4", "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_regularizer": null, "trainable": true, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "bias_regularizer": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}